## Pandas and conditional statement

In [1]:
import pandas as pd
import numpy as np

In [6]:
store1 = pd.DataFrame()
store1["Product1"] = ["Mac", "Ipad", "Iphone", "IWatch", "TV"]
store1["Price1"] = [2000, 800, 700, 500, 300]

In [7]:
store2 = pd.DataFrame()
store2["Product2"] = ["Mac", "Ipad", "Iphone", "IWatch", "TV"]
store2["Price2"] = [1900, 750, 650, 500, 300]

In [4]:
np.where

In [8]:
np.where(store1["Price1"]==store2["Price2"], True, False)

array([False, False, False,  True,  True])

In [10]:
store1['Same'] = np.where(store1["Price1"]==store2["Price2"], True, False)

In [11]:
store1

  Product1  Price1   Same
0      Mac    2000  False
1     Ipad     800  False
2   Iphone     700  False
3   IWatch     500   True
4       TV     300   True

In [14]:

np.where(store1["Price1"]==store2["Price2"], \
         0, abs(store1["Price1"]-store2["Price2"]))

array([100,  50,  50,   0,   0])

In [15]:
store1["Difference"] = np.where(store1["Price1"]==store2["Price2"], \
         0, abs(store1["Price1"]-store2["Price2"]))

In [16]:
store1

  Product1  Price1   Same  Difference
0      Mac    2000  False         100
1     Ipad     800  False          50
2   Iphone     700  False          50
3   IWatch     500   True           0
4       TV     300   True           0

In [19]:
## If price not same, decrease price by 10%, else leave price as is, in store1

store1["Sale"] = np.where(store1['Same']==False, store1['Price1']*0.9, store1['Price1'])

In [20]:
store1

  Product1  Price1   Same  Difference    Sale
0      Mac    2000  False         100  1800.0
1     Ipad     800  False          50   720.0
2   Iphone     700  False          50   630.0
3   IWatch     500   True           0   500.0
4       TV     300   True           0   300.0

In [23]:
# Whole df goes into apply by columns
store1["Sale_L"] = store1.apply(lambda df : df["Price1"] if df["Same"] else df["Price1"]*0.9, \
             axis=1)

In [24]:
store1

  Product1  Price1   Same  Difference    Sale  Sale_L
0      Mac    2000  False         100  1800.0  1800.0
1     Ipad     800  False          50   720.0   720.0
2   Iphone     700  False          50   630.0   630.0
3   IWatch     500   True           0   500.0   500.0
4       TV     300   True           0   300.0   300.0

In [25]:
store1["Price1"].apply(lambda p : p*0.8 if p >500 else p)

0    1600.0
1     640.0
2     560.0
3     500.0
4     300.0
Name: Price1, dtype: float64

In [26]:
## Another option for the same
## iloc (by index), loc (by label)
### Use loc to do conditional statement

In [27]:
store1.loc[store1["Price1"]>500, "MegaSale"] = store1["Price1"]*0.8
store1.loc[store1["Price1"]<500, "MegaSale"] = store1["Price1"]*0.9

In [29]:
# No condition for condition

store1

  Product1  Price1   Same  Difference    Sale  Sale_L  MegaSale
0      Mac    2000  False         100  1800.0  1800.0    1600.0
1     Ipad     800  False          50   720.0   720.0     640.0
2   Iphone     700  False          50   630.0   630.0     560.0
3   IWatch     500   True           0   500.0   500.0       NaN
4       TV     300   True           0   300.0   300.0     270.0

In [30]:
store1.loc[store1["Price1"]>500, "MegaSale"] = store1["Price1"]*0.8
store1.loc[store1["Price1"]==500, "MegaSale"] = store1["Price1"]
store1.loc[store1["Price1"]<500, "MegaSale"] = store1["Price1"]*0.9

In [31]:
## Interview question

df = pd.DataFrame(data=range(1, 101), columns=["Numbers"])

In [32]:
df

    Numbers
0         1
1         2
2         3
3         4
4         5
..      ...
95       96
96       97
97       98
98       99
99      100

[100 rows x 1 columns]

In [33]:
## Interview question
## Go check each number and see if %3 with no remainder, print Fizz
## %5, print Buzz
## %5 and %3, print FizzBuzz

In [38]:
def fizzBuzz(n):
    '''
    Python is interpreter, not compiler
    Order does matter
    Have to run FizzBuzz condition on top
    '''
    if n%3 and n%5 == 0:
        result = "FizzBuzz"
    elif n%3 == 0:
        result = "Fizz"
    elif n%5 == 0:
        result = "Buzz"
    else:
        result = str(n)
    return result

In [35]:
df["FizzBuzz"] = df["Numbers"].apply(fizzBuzz)

In [36]:
df

    Numbers  FizzBuzz
0         1         1
1         2         2
2         3      Fizz
3         4         4
4         5  FizzBuzz
..      ...       ...
95       96      Fizz
96       97        97
97       98        98
98       99      Fizz
99      100  FizzBuzz

[100 rows x 2 columns]